Mustafamado/PIC18F4520_MPLABXProjects/Libraries/pic18f4520_adc.c
Returns         : None

Remarks        : This function sets the ADCON0<GO> bit and thus
		    starts conversion.
**************************************************************************************/ 
void ConvertADC(void)
{
  ADCON0bits.GO = 1;
}

#elif defined (ADC_V9) || defined (ADC_V9_1)
/************************************************************************************
Function       : void ConvertADC(void)
 
Overview     : This function starts the A/D conversion.
 
Parameters   : None

Returns         : None

Remarks        : This function sets the ADCON0<GO> bit and thus
		    starts conversion.
**************************************************************************************/ 
void ConvertADC(void)
{
  WDTCONbits.DEVCFG = 0;  
  ADCON0bits.GO = 1;
}

#elif defined (ADC_V15) || defined (ADC_V15_1)
/************************************************************************************
Function       : void ConvertADC(void)
 
Overview     : This function starts the A/D conversion.
 
Parameters   : None

Returns         : None

Remarks        : This function clears the ADCON1L<SAMP> bit and thus stops 
                 sampling and starts conversion.This happens only when 
                 trigger source for the A/D conversion is selected as Manual,
                 by clearing the ADCON1L <SSRC> bits.
**************************************************************************************/ 
void ConvertADC(void)
{
  ADCON1Lbits.SAMP = 0; /* clear SAMP to start conversion*/
}
#endif

/* adcopen.c (Combined with all adc functions in adc.c by Burak Enez) */

#if defined (ADC_V1)
void OpenADC( unsigned char config, 
              unsigned char config2)
{
  ADCON0 = 0;

  ADCON1 = config;
  ADCON0 = ((config<<2) & 0xC0)|(config2 & 0b00111000);
  if( config2 & 0b10000000 )
  {
    PIR1bits.ADIF = 0;
    PIE1bits.ADIE = 1;
    INTCONbits.PEIE = 1;
  }
  ADCON0bits.ADON = 1;
}

#elif defined (ADC_V2)
void OpenADC( unsigned char config, 
              unsigned char config2)
{
  ADCON0 = 0;
  ADCON1 = 0;
  ADCON2 = 0;
  
  ADCON0 = (config2 >> 1) & 0b00111100;
  ADCON1 = ((config2 << 4) & 0b00110000) |
           (config & 0b00001111);
  ADCON2 = (config & 0b10000000) |
           ((config >> 4) & 0b00000111);

  if( config2 & 0b10000000 )
  {
    PIR1bits.ADIF = 0;
    PIE1bits.ADIE = 1;
    INTCONbits.PEIE = 1;
  }
  ADCON0bits.ADON = 1;
}

#elif defined (ADC_V3)
void OpenADC( unsigned char config,
              unsigned char config2,
              unsigned char portconfig)
{
    ADCON0 = 0;
    ADCON2 = 0;

    ADCON0 = ((config2 >> 1) & 0b00111100) |
	         ((config2 << 6) & 0b11000000);
	ADCON1 = portconfig;
    ADCON2 = ((config & 0b10000000)|((config >> 4) & 0b00000111)) |
	         ((config << 2) & 0b00111000);

    if( config2 & 0b10000000 )
    {
      PIR1bits.ADIF = 0;
      PIE1bits.ADIE = 1;
      INTCONbits.PEIE = 1;
    }
    ADCON0bits.ADON = 1;
}

#elif defined (ADC_V4) || defined (ADC_V5) || defined (ADC_V6)
void OpenADC( unsigned char config,
              unsigned char config2,
              unsigned char portconfig)
{
    ADCON0 = 0;
    ADCON2 = 0;

    ADCON0 = (config2 >> 1) & 0b00111100;	// GET CHANNELS 
    ADCON1 = (portconfig & 0b00001111) |                   // GET CONFIG
	         ((config2 << 4) & 0b00110000); //GET  Vref
    ADCON2 = (config & 0b10000000)	|	// RESULT
             ((config >> 4) & 0b00000111) |	// CONV CLK
             ((config << 2) & 0b00111000);	// ACQ TIME

    if( config2 & 0b10000000 )			// ADC INT.
    {
      PIR1bits.ADIF = 0;
      PIE1bits.ADIE = 1;
      INTCONbits.PEIE = 1;
    }
    ADCON0bits.ADON = 1;
}

#elif defined (ADC_V8)
void OpenADC( unsigned char config,
              unsigned char config2,
              unsigned int portconfig)
{
    ADCON0 = 0;
    ADCON1 = 0;
    ADCON2 = 0;

    ADCON0 = (config2 >> 1) & 0b00111100;
    ADCON1 |= (config2 << 4) & 0b00110000;
    ADCON2 = config & 0b10000000 |
             ((config >> 4) & 0b00000111) |
             ((config << 2) & 0b00111000);

    ANSEL = portconfig;
    ANSELH = (portconfig >> 8);
	if( config2 & 0b10000000 )
    {
      PIR1bits.ADIF = 0;
      PIE1bits.ADIE = 1;
      INTCONbits.PEIE = 1;
    }
    ADCON0bits.ADON = 1;
}

#elif defined (ADC_V7)
void OpenADC( unsigned char config1, 
              unsigned char config2, 
              unsigned char config3)
{	// Reset A/D Registers to POR state    
	ADCON0 = 0;
    ADCON1 = 0;
	ADCON3 = 0;	
	ANSEL0 = 0;
	ANSEL1 = 0;
	ADCHS  = 0;
	
	ADCON0 = (config1<<2) & 0b00111100;	//assign Conv type, conv mode and conv seq.
	ADCON1 = (config2 & 0b11000000) | ((config2 >>1) & 0b00010000);
	ADCON2 = config3;
	ADCON3 = (config2 & 0b00011111) | (config1 & 0b11000000);
    if(config1 & 0b00100000)	
	{
		PIR1bits.ADIF = 0;
      	PIE1bits.ADIE = 1;
      	INTCONbits.PEIE = 1;
	}
	ADCON0bits.ADON = 1;         // Enable the A/D module
}

#elif defined (ADC_V7_1)
void OpenADC( unsigned char config1, 
              unsigned char config2, 
              unsigned char config3)
{	// Reset A/D Registers to POR state    
	ADCON0 = 0;
    ADCON1 = 0;
	ADCON3 = 0;	
	ANSEL0 = 0;
	ADCHS  = 0;
	
	ADCON0 = (config1<<2) & 0b00111100;	//assign Conv type, conv mode and conv seq.
	ADCON1 = (config2 & 0b11000000) | ((config2 >>1) & 0b00010000);
	ADCON2 = config3;
	ADCON3 = (config2 & 0b00011111) | (config1 & 0b11000000);
    if(config1 & 0b00100000)	
	{
		PIR1bits.ADIF = 0;
      	PIE1bits.ADIE = 1;
      	INTCONbits.PEIE = 1;
	}
	ADCON0bits.ADON = 1;         // Enable the A/D module
}

#elif defined (ADC_V9) || defined (ADC_V9_1)
void OpenADC( unsigned char config,
              unsigned char config2,
              unsigned int portconfig)
{
    WDTCONbits.ADSHR = 0;
    ADCON0 = 0;
    ADCON1 = 0;

    ADCON0 = ((config2 >> 1) & 0b00111100) | //channel
             ((config2 << 6) & 0b11000000);	//VREF
    ADCON1 = (config & 0b10000000) | //Result Format
             ((config >> 4) & 0b00000111) | //Conversion clock select
             ((config << 2) & 0b00111000); //acquisition time

